Repository: LambdaDigamma/moers-ios
Catalog: Core/Sources/Core/Resources/*.lproj/Localizable.strings
Languages: de

# Menu.dashboard
source: Today
de: Heute

# Menu.news
source: News
de: Neuigkeiten

# Menu.map
source: Map
de: Karte

# Menu.events
source: Events
de: Veranstaltungen

# Menu.other
source: Other
de: Sonstiges

# Buergerfunk.title
source: Community radio
de: Bürgerfunk

# Buergerfunk.description
source: Every day between 8 p.m. and 9 p.m. on Radio K.W. (Sundays and holidays from 7:04 p.m.), there is a slightly different kind of radio - community radio. People from the county of Wesel spend many hours of their free time in production studios to send an hour of radio programming over the airwaves every day.
de: Täglich gibt es zwischen 20 und 21 Uhr auf Radio K.W. (sonn- und feiertags ab 19:04 Uhr) ein etwas anderes Radio – den Bürgerfunk. Menschen aus dem Kreis Wesel verbringen viele Stunden ihrer Freizeit in Produktionsstudios, um täglich eine Stunde Programm über den Äther zu schicken.

# Buergerfunk.nextBroadcasts
source: Next broadcasts
de: Nächste Sendungen

# Buergerfunk.contactAction
source: Contact
de: Kontaktieren

# Buergerfunk.disclaimer
source: The information is supplied by Bürgerfunk Moers. There is no guarantee for correctness or completeness.
de: Die Daten werden vom Bürgerfunk Moers zur Verfügung gestellt. Es besteht keine Garantie auf Richtigkeit bzw. Vollständigkeit.

# Buergerfunk.allAction
source: All
de: Alle

# Buergerfunk.listenToPastBroadcasts
source: Listen to recent broadcasts
de: Vergangene Sendungen hören

# Buergerfunk.unknownTime
source: Time not known
de: Uhrzeit nicht bekannt

# Buergerfunk.listenNowAction
source: Listen now
de: Jetzt hören

# Buergerfunk.remindMeAction
source: Remind me
de: Erinnerung erstellen

# Buergerfunk.disableReminderInfo
source: Tap again to remove the reminder.
de: Tippe erneut, um die Erinnerung wieder zu löschen.

# Directions.getDirections
source: Get directions
de: Route berechnen

# UserActivities.Dashboard.title
source: Show today
de: Heute anzeigen

# UserActivities.RubbishSchedule.title
source: Next pick up dates
de: Nächste Abholtermine

# UserActivities.RubbishSchedule.keywords
source: Garbage, collection, date, garbage collection
de: Müll, Abholung, Datum, Müllabfuhr

# UserActivities.ParkingAreaOverview.title
source: Show free sites
de: Freie Parkplätze anzeigen

# UserActivities.ParkingAreaOverview.keywords
source: Parking, Car, Driving, City
de: Parkplätze, Auto, Fahren, Stadt, Parken

# UserActivities.FuelStations.title
source: Fuel stations near you
de: Tankstellen in der Nähe

# UserActivities.FuelStations.keywords
source: Gas stations, prices, proximity, car, Fuel
de: Tankstellen, Preise, Nähe, Auto

# UserActivities.News.title
source: Check latest news
de: Neuste Nachrichten ansehen

# UserActivities.Map.title
source: Find location
de: Ort suchen

# UserActivities.Events.title
source: Show events
de: Veranstaltungen anzeigen

# UserActivities.Settings.title
source: Show settings
de: Einstellungen anzeigen

source: Citizen
de: Einwohner

source: Petrol Station
de: Tankstelle

source: E5
de: Super

source: E10
de: Super E10

source: Residual Waste
de: Restabfall

source: Organic Waste
de: Biotonne

source: Paper Waste
de: Papiertonne

# YellowWaste
source: Yellow Bag
de: Gelber Sack

# GreenWaste
source: Green Cuttings
de: Grünschnitt

source: Today
de: Heute

source: Tomorrow
de: Morgen

source: Parking Lot
de: Parkplatz

# ParkingLotUnchanged
source: unchanged
de: unverändert

# ParkingLotDescends
source: falling
de: fallend

# ParkingLotAscends
source: raising
de: aufsteigend

# ParkingLotUndocumented
source: undocumented
de: nicht erfasst

# Camera
source: 360° Camera
de: 360° Kamera

source: Bike Charging Station
de: E-Bike Ladestation

source: free
de: kostenlos

# NeedsFestivalTicket
source: festival/day ticket required
de: Eintritt mit Festival-/Tagesticket

# ExtraTicket
source: festival/day ticket or Mörzz-Ticket required (*)
de: Festival-/Tagesticket oder Mörzz-Ticket (*)

# NotKnownPrompt
source: not yet announced
de: noch nicht bekannt

# LocationNotKnown
source: Site soon known
de: Ort bald bekannt

# RubbishCollectionNotificationTitle
source: Pick-up Schedule
de: Abfuhrkalender

# RubbishCollectionNotificationBody
source: Tomorrow will be collected:
de: Morgen wird abgeholt:

source: live now
de: jetzt live
