Repository: LambdaDigamma/moers-ios
Catalog: ParkingFeature/Sources/ParkingFeature/*.lproj/Localizable.strings
Languages: de

# ParkingAreaList.title
source: Free parking spaces
de: Freie Parkplätze

# ParkingAreaList.titleNearYou
source: Free parking spaces near you
de: Freie Parkplätze in Deiner Nähe

# ParkingAreaList.filterDescription
source: Filter parking spaces
de: Filtere Parkplätze

# ParkingAreaList.filterAll
source: All
de: Alle

# ParkingAreaList.filterOnlyOpen
source: Only open
de: Nur geöffnete

# ParkingAreaList.disclaimer
source: All data without liability. The current parking situation may differ from the data shown.
de: Alle Angaben ohne Gewähr. Die aktuelle Parksituation kann von den gezeigten Daten abweichen.

# ParkingAreaList.dataSource
source: Data source: Parking management system of the city of Moers
de: Datenquelle: Parkleitsystem der Stadt Moers

# Dashboard.title
source: Free parking spaces
de: Freie Parkplätze

# ParkingAreaDetail.free
source: / %@ free
de: / %@ frei

# ParkingAreaDetailScreen.currentAvailability
source: Current occupancy
de: Aktuelle Belegung

# ParkingAreaDetailScreen.free
source: free
de: frei

# ParkingAreaDetailScreen.pricesTitle
source: Pricing
de: Preise

# ParkingAreaDetailScreen.noPrices
source: No pricing information
de: Keine Preisinformationen
