Repository: LambdaDigamma/moers-ios
Catalog: ios/moers festival/moers festival/Assets/*.lproj/Localizable.strings
Languages: de

# NewsTabItem
source: News
de: Neuigkeiten

# MapTabItem
source: Map
de: Karte

# UserScheduleTabItem
source: Favorites
de: Favoriten

# EventsTabItem
source: Schedule
de: Spielplan

# OtherTabItem
source: Other
de: Sonstiges

# InfoTabItem
source: Info & Tickets
de: Infos & Tickets

# LicensesTitle
source: Licenses
de: Lizenzen

# AboutTitle
source: About
de: Über

# LegalTitle
source: Legal
de: Impressum

source: Add
de: Hinzufügen

# QuestionPrompt
source: Ask your question:
de: Stellen Sie Ihre Frage:

# SearchEventsPrompt
source: Search Events
de: Suche Veranstaltungen

# SearchBarPrompt
source: Search a place
de: Suche einen Ort

# EntryTitle
source: Welcome to the festival village!
de: Herzlich willkommen im Festivaldorf!

# EntryBody
source: The moers festival app helps you to easily find your way around the program. You can also put together your own program in the app and get lots of other important information.
de: Die moers festival App hilft Dir, Dich im Programm zurecht zu finden. Du kannst Dir außerdem in der App Dein eigenes Programm zusammenstellen und viele weitere wichtige Informationen bekommen.

# EntrySubtitle
source: Nice to see you!
de: Schön, dass Du da bist!

# ExitTitle
source: See you later!
de: Auf Wiedersehen!

# ExitBody
source: Thanks for coming. We hope you had fun!
de: Schön, dass Du da warst. Wir hoffen, Du hattest Spaß!

source: Allow
de: Erlauben

source: Later
de: Später

source: Continue
de: Weiter

# OnboardingDescription
source: Discover the moers festival
de: Entdecke das moers festival

# OnboardingFirstPageActionButtonTitle
source: Continue
de: Fortfahren

# OnboardingNotificationPageTitle
source: Push Notifications
de: Push-Mitteilungen

# OnboardingNotificationPageDescription
source: Receive push notifications to get all the latest news about Moers Festival.
de: Erhalte Push Notifications, um alles Aktuelle über das moers festival zu erfahren.

# OnboardingNotificationPageActionButtonTitle
source: Subscribe
de: Erhalten

# OnboardingNotificationPageAlternativeButtonTitle
source: Not now
de: Nicht jetzt

# OnboardingLocationPageTitle
source: Location
de: Standort

# OnboardingLocationPageDescription
source: Moers Festival uses your location to provide you with more detailed information about the sites and moving stages.
de: Moers Festival nutzt den Standort, um Dir detailiertere Informationen zu den Spielorten und mobilen Bühnen zu geben.

# PrivacyPageTitle
source: Privacy
de: Datenschutz

# PrivacyPageDescription
source: All data will be treated with the utmost care and confidentiality! By using this app, you agree to the terms and conditions and privacy policy found in the menu.
de: Alle Daten werden mit größter Vorsicht und höchster Vertraulichkeit behandelt! Mit der Benutzung dieser App stimmen Sie den AGBs und Datenschutzbestimmungen, die Sie im Menü finden, zu.

# PrivacyPageButtonTitle
source: Understood
de: Verstanden

# MoersAppPageDescription
source: Mein Moers is a nice addition to this app. Explore the city with 360° panoramas, find shops and get current parking allocation data.
de: Mein Moers ist eine sinnvolle Ergänzung zu dieser App. Suche Geschäfte & Parkplätze mit Live-Daten und bewege Dich mit interaktiven 360° Panoramen durch die Stadt!

# MoersAppPageAlternativeButtonTitle
source: Later
de: Später

# CompletionPageTitle
source: Setup completed
de: Einrichtung abgeschlossen

# CompletionPageActionButtonTitle
source: Get started
de: Los geht's!

# StaffLoginTitle
source: Staff-Login
de: Mitarbeiter-Zugang

# StaffLoginPageTitle
source: Staff-Login
de: Mitarbeiter-Zugang

# StaffLoginPagePlaceholder
source: Password
de: Passwort

# StaffLoginPageActionButtonTitle
source: Login
de: Anmelden

# LoginFailedPageTitle
source: Login failed
de: Anmeldung fehlgeschlagen

# NewsOfficialSegmentTitle
source: Official
de: Offiziell

# NewsSocialSegmentTitle
source: Social
de: Sozial

# LoadingTracker
source: Loading...
de: Lädt...

# NoDescription
source: No description provided.
de: Keine Beschreibung vorhanden.

# Stages
source: Venues
de: Spielorte

# NoMovingActs
source: Currently there are no 'moving acts'.
de: Momentan gibt es keine 'Moving Acts'.

source: Last Update
de: Letztes Aktualisierung

source: Show more
de: Mehr anzeigen

# UpcomingFavourites
source: Upcoming Favorites
de: bevorstehende Favoriten

source: Favourites
de: Favoriten

source: Upcoming
de: Bevorstehend

source: live now
de: jetzt live

# EventsNoFavourite
source: No event has been marked as a favorite yet.
de: Du hast noch keine Veranstaltung als Favoriten markiert.

# EventsNoLive
source: Currently there are no events taking place.
de: Gerade finden keine Veranstaltungen statt.

# EventsNoUpcoming
source: Currently there are no events scheduled. Come back soon!
de: Momentan sind keine Veranstaltungen geplant. Komme demnächst noch einmal wieder!

# NavigationButtonMovingAct
source: Show current position
de: Aktuelle Position zeigen

# FestivalHeading
source: The festival
de: Das Festival

# LodgingHeading
source: Lodging
de: Schlafen

# AccessibilityHeading
source: Accessibility
de: Barrierefreiheit

source: Retrospect
de: Rückblick

source: Buy
de: Kaufen

# FestivalTickets
source: Festival ticket
de: Festivaltickets

# FestivalDate
source: May 29 - June 01
de: 29. Mai bis 01. Juni

source: Day ticket
de: Tagesticket

# FridayDate
source: Friday, 29th of May
de: Freitag, 29. Mai

# SaturdayDate
source: Saturday, 30th of May
de: Samstag, 30. Mai

# SundayDate
source: Sunday, 31th of May
de: Sonntag, 31. Mai

# MondayDate
source: Monday, 01st of June
de: Montag, 01. Juni

source: Presale
de: Vorverkauf

source: Box office
de: Tageskasse

source: Presale (discount)
de: Vorverkauf (ermäßigt)

source: Box office (discount)
de: Tageskasse (ermäßigt)

# EventDetailViewControllerSubtitleLabel
source: Site and date of this Event
de: Ort und Datum der Veranstaltung

# ShowNextEvents
source: Show the next events
de: Zeige die nächsten Veranstaltungen

# ShowSpecificEvent
source: Show the event
de: Zeige die Veranstaltung

# EventKeyword
source: Events
de: Veranstaltungen

# ShortcutFavourites
source: Show Favourites
de: Zeige Favoriten

# ShortcutEvents
source: Show Events
de: Zeige Veranstaltungen

# ShortcutNews
source: Show News
de: Zeige Neuigkeiten

source: Venue unknown
de: Ort unbekannt

source: City unknown
de: Stadt unbekannt

# SettingsTitle
source: Settings
de: Einstellungen

# DeleteAction
source: Delete
de: Löschen

# MuteAction
source: Mute
de: Stumm

# MutedPageDescription
source: You have been muted by the operator and can no longer ask questions.
de: Sie wurden vom Betreiber stumm geschaltet und können keine Fragen mehr stellen.

source: Loading live stream...
de: Lädt Livestream...

# LivestreamInactiveTitle
source: Livestream not running
de: Livestream nicht aktiv

# LivestreamInactiveDescription
source: The livestream is currently not running. Check the schedule to see when the next event takes place.
de: Der Livestream ist momentan nicht aktiv. Sieh im Spielplan nach, wann die nächste Veranstaltung stattfindet.

# CountdownDays
source: days
de: Tage

# CountdownHours
source: hours
de: Stunden

# CountdownMinutes
source: minutes
de: Minuten

# CountdownSeconds
source: seconds
de: Sekunden

# CountdownText
source: Is this noch a jazz fest? You really want to give your children something? You long for rush, loudness, extreme experiences? You want to speak your language with other beings? You want to finally camp out in the hippocampus? You want to actually choose and decide for yourself? Come to Moers from June 03 to 06, 2022, come to moersland - come to Metamörsum! Because we want to celebrate with you and find out what the possible futures of the next 50 years of moers festival will be like. After our analogue online festival in 2020 and the first concerts ever with an audience at Whitsun 2021, after our exploration of the green screen in all its creative imperfection, after our pretending to be in the room just for you, there is the (unsurprising) realization that social events like the moers festival will have to react to unforeseeable influences in the future - political, climatic, pandemic... Moers remains true to itself and continues to improvise, showing attitude and possibilities. Definitely also at Whitsun 2022 - whether in the festival hall, on the Am Viehtheater, in moersland or on fleeing stages in the castle park; with light sense we venture again on a surreal trip through meadows, freedom, wild seas, semi-detached houses and moonscapes.
de: Is this noch a jazz fest? Du möchtest Deinen Kindern wirklich etwas mitgeben? Du sehnst Dich nach Rausch, Lautstärke, Grenzerfahrungen? Du möchtest Deine Sprache mit anderen Wesen sprechen? Du willst endlich mal im Hippocampus zelten? Du willst tatsächlich selbst wählen und entscheiden? Komm vom 03. bis 06. Juni 2022 nach Moers, komm ins moersland - komm ins Metamörsum! Denn wir möchten mit Dir nachfeiern und auskundschaften, wie die möglichen Zukünfte der nächsten 50 Jahre moers festival wohl werden. Nach unserem analogen Online-Festival 2020 und den ersten Konzerten überhaupt mit Publikum zu Pfingsten 2021, nach unserer Erforschung des Greenscreens in seiner kreativen Unperfektheit, nach unserem für euch extra vorgetäuschten Raumvorhandenseinsgefühl steht die (wenig überraschende) Erkenntnis, dass soziale Ereignisse wie das moers festival auch künftig auf unabsehbare Einflüsse reagieren müssen – politisch, klimatisch, pandemisch… Moers bleibt sich treu und improvisiert weiter, zeigt Haltung und Möglichkeiten. Ganz bestimmt auch zu Pfingsten 2022 - ob in der Festivalhalle, auf dem Am Viehtheater, im moersland oder auf flüchtenden Bühnen im Schlosspark; mit leichtem Sinn wagen wir uns wieder auf einen surrealen Trip durch Wiesen, Freiheit, wilde Meere, Doppelhaushälften und Mondlandschaften.

# WNItem1_6-1Title
source: New planning
de: Neue Planung

# WNItem1_6-1Subtitle
source: Due to the current situation, the moers festival must unfortunately take place without any audience.
de: Aufgrund der aktuellen Situation muss das moers festival leider ohne Publikum stattfinden.

# WNItem1_6-2Title
source: Enjoy the app live
de: Live in der App

# WNItem1_6-2Subtitle
source: All concerts will be shown for free on Arte Concert and right in the app!
de: Alle Auftritte werden kostenlos auf Arte Concert und direkt in der App zu sehen sein!

# WNItem1_6-3Subtitle
source: You can find information about ticket return or donation in the menu.
de: Informationen zur Ticketrückgabe oder -spende findet ihr im Menü.

# WNItem1_6-4Subtitle
source: If you want to support us, visit our moerschandise shop in the menu!
de: Wenn ihr uns unterstützen wollt, besucht unseren moerschandise-Shop im Menü!

# TourTabItem
source: Exhibition
de: Ausstellung

# ScanStationTitle
source: Scan Station
de: Station scannen

# ScanStationPrompt
source: Scan the QR code with the camera of your device. Simply move the marked square over the QR code on the floor.
de: Scanne den QR Code mit der Kamera Deines Geräts. Bewege hierzu das markierte Quadrat über den QR Code auf dem Boden.

# WNCompletionText
source: Continue
de: Fortfahren
